In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dict2 = {'Names': ['Sagar','Trishya',np.nan,'Sirisha'],
        'Age':[np.nan,22,26,22],
        'City':['Hyd','Blr','Chennai',np.nan]}
dict2

{'Names': ['Sagar', 'Trishya', nan, 'Sirisha'],
 'Age': [nan, 22, 26, 22],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [4]:
d1=pd.DataFrame(dict1)

**Note**

-

In [5]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [7]:
dict2 = {'Names': ['Sagar','Trishya',None,'Sirisha'],
        'Age':[np.nan,22,26,22],
        'City':['Hyd','Blr','Chennai',None]}
pd.DataFrame(dict2)

     Names   Age     City
0    Sagar   NaN      Hyd
1  Trishya  22.0      Blr
2     None  26.0  Chennai
3  Sirisha  22.0     None

In [8]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

**Method-1**

In [11]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan :  not a number this applicable for numerical columns only

- Generally data has some empty rows

- it is data problem

- if you read that kind of data you will see null

- you need to understand it is a data corrupted or really a null value are there

***method-1***

Fill with some random value 

Method name : Fill na

In [12]:
d1.fillna(20)

     Names   Age     City
0    Sagar  20.0      Hyd
1  Trishya  22.0      Blr
2       20  26.0  Chennai
3  Sirisha  22.0       20

**method-2**

- we can fill value w.r.t columns also

-  it will not not updated

-  inplace = false

In [20]:
d1['Age'].fillna(22,inplace=True)

In [22]:
d1['Names'].fillna('vasuki',inplace=True)

In [23]:
d1

     Names   Age     City
0    Sagar  40.0      Hyd
1  Trishya  22.0      Blr
2   vasuki  26.0  Chennai
3  Sirisha  22.0      NaN

In [24]:
d1

     Names   Age     City
0    Sagar  40.0      Hyd
1  Trishya  22.0      Blr
2   vasuki  26.0  Chennai
3  Sirisha  22.0      NaN

In [25]:
dict1 = {'Names': ['Sagar','Trishya',np.nan,'Sirisha'],
        'Age':[np.nan,22,26,22],
        'City':['Hyd','Blr','Chennai',np.nan]}
dict1

d1 =pd.DataFrame(dict1)

In [26]:
d1

     Names   Age     City
0    Sagar   NaN      Hyd
1  Trishya  22.0      Blr
2      NaN  26.0  Chennai
3  Sirisha  22.0      NaN

**Method-3**

- B-Fill

- F-Fill

- pad

- back-Fill

In [30]:
d1.fillna(method='bfill',axis=1)
# col-1 name index 3 is missing value it is filled with index 4 value
# col-2 Age  index 1 is missing value it is filled with index 2 value
# col-3 name index 4 is missing value it should be fill with net value 
              # but we don't have next value

C:\Users\hp\AppData\Local\Temp\ipykernel_19356\1103776312.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

     Names   Age     City
0    Sagar   Hyd      Hyd
1  Trishya  22.0      Blr
2     26.0  26.0  Chennai
3  Sirisha  22.0      NaN

In [29]:
d1.fillna(method='ffill',axis=1)

C:\Users\hp\AppData\Local\Temp\ipykernel_19356\13672963.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill',axis=1)

     Names    Age     City
0    Sagar  Sagar      Hyd
1  Trishya   22.0      Blr
2      NaN   26.0  Chennai
3  Sirisha   22.0     22.0

In [31]:
d1.fillna(method='backfill',axis=1)

C:\Users\hp\AppData\Local\Temp\ipykernel_19356\3586447502.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill',axis=1)

     Names   Age     City
0    Sagar   Hyd      Hyd
1  Trishya  22.0      Blr
2     26.0  26.0  Chennai
3  Sirisha  22.0      NaN

In [32]:
d1.fillna(method='pad',axis=0)

C:\Users\hp\AppData\Local\Temp\ipykernel_19356\1966724371.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad',axis=1)

     Names    Age     City
0    Sagar  Sagar      Hyd
1  Trishya   22.0      Blr
2      NaN   26.0  Chennai
3  Sirisha   22.0     22.0

backfill and bill fill with next value 

pad and ffill fill with previous value 

but it will chang based on axis

**Method-4**

**Mean-MediAN-Mode**

- mean

    - numerical value can fill with mean value
 
    -  but mean affect by outliers
 
    -   if we dont have outlier it is best one

- median

    -  numnumerical value can fill with median value
 
    -   we known tha median value dose not affect with outlier
 
    -    so if outlier are there we can go with median

In [ ]:
dict1 = {'Names': ['Sagar','Trishya',np.nan,'Sirisha'],
        'Age':[np.nan,22,26,22],
        'City':['Hyd','Blr','Chennai',np.nan]}
dict1

d1 =pd.DataFrame(dict1)

In [33]:
# we already know we can fill  with some value based on specific columns using fisrt 
# d1.fillna(<>)
#d1.resprensent all the columns 

age_mean = d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    23.333333
1    22.000000
2    26.000000
3    22.000000
Name: Age, dtype: float64

In [34]:
age_median = d1['Age'].median()
d1['Age'].fillna(age_median)

0    22.0
1    22.0
2    26.0
3    22.0
Name: Age, dtype: float64

In [35]:
age_mode = d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    22.0
1    22.0
2    26.0
3    22.0
Name: Age, dtype: float64

In [ ]:
d1['City'].mode()
# in this use case we are getting mode equal 
# But in realtime we will get clear mode values

**method-5** (**IMP**)

$$KNN-imputer$$

- Knn : k neartest neighbours

-  k is Hyper parameter mean user can choose

-   it is disance metric : **Euclidian distance**

-    knn imputer will take the maen of the neigbour value

-  the neibhour value can provide by using value  = k

-   it is under slearn

**formula:root(x2-x1)*sq-(y2-y1)*sq**

In [38]:
from sklearn.impute import KNNImputer

kn = KNNImputer()

kn.fit_transform(d1[['Age']])

array([[23.33333333],
       [22.        ],
       [26.        ],
       [22.        ]])